custom/base-preferences.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-24 Mon 13:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Base Preferences</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ryan Durling" />
</head>
<body>
<div id="content">
<h1 class="title">Base Preferences</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org904e59d">1. Don't question me</a></li>
<li><a href="#org2965c6b">2. We need diminish</a></li>
<li><a href="#orgfc4498c">3. Backups</a></li>
<li><a href="#org45ac9b7">4. Enabling the disabled</a>
<ul>
<li><a href="#orgf884fbf">4.1. upcase and downcase region</a></li>
<li><a href="#orgee97db7">4.2. Narrowing the region to what I want to look at</a></li>
</ul>
</li>
<li><a href="#orga56bfba">5. Custom configuration location</a></li>
<li><a href="#orgb675c92">6. Colors</a>
<ul>
<li><a href="#org5390d60">6.1. Color Theme Sanityinc Tomorrow</a></li>
<li><a href="#org42d9406">6.2. Powerline</a></li>
</ul>
</li>
<li><a href="#org569a5f5">7. Cursors</a>
<ul>
<li><a href="#orga5d9f88">7.1. Show me where the cursor is</a></li>
<li><a href="#org0582cb9">7.2. Deleteing a selection</a></li>
<li><a href="#orge151c24">7.3. Show parens</a></li>
<li><a href="#orgc32c7c8">7.4. indent automatically on a new line</a></li>
</ul>
</li>
<li><a href="#org22069aa">8. Bars, columns and lines</a></li>
<li><a href="#org692389a">9. Startup Screen</a></li>
<li><a href="#orgf4ab8fc">10. Toggle window split</a></li>
<li><a href="#org5e2e032">11. displaying the file buffer</a></li>
<li><a href="#org06c8d71">12. Whitespace</a></li>
<li><a href="#orge6f476b">13. Auto indent</a></li>
<li><a href="#orgc62962c">14. Auto Complete</a></li>
<li><a href="#org1e80be3">15. Spell checking</a>
<ul>
<li><a href="#orgbedda17">15.1. Setup fly spell</a></li>
<li><a href="#org55f022a">15.2. Performance</a></li>
<li><a href="#org0e7269e">15.3. I like having a pop-up with spelling suggestions.</a></li>
<li><a href="#org0b376f9">15.4. I also want it to work no matter what mode emacs is in (i.e. GUI or terminal)</a></li>
<li><a href="#orga12a570">15.5. Finally I want simple ways to invoke it.</a></li>
</ul>
</li>
<li><a href="#org88ea5c1">16. File tree</a></li>
</ul>
</div>
</div>
<p>
<a href="../README.html">Back to main config</a>
</p>

<div id="outline-container-org904e59d" class="outline-2">
<h2 id="org904e59d"><span class="section-number-2">1</span> <a href="https://www.emacswiki.org/emacs/YesOrNoP">Don't question me</a></h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2965c6b" class="outline-2">
<h2 id="org2965c6b"><span class="section-number-2">2</span> We need <a href="https://github.com/emacsmirror/diminish">diminish</a></h2>
<div class="outline-text-2" id="text-2">
<p>
There are some variables we'll really want to set up before
everything gets kicked off. Usually we'd want to do this by using
the :config key in use-package, but sometimes, I'm not smart enough
to know how to do it. Abbreviate or hide all the minor modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">use-package</span> <span style="color: #7aa6da;">diminish</span> <span style="color: #c397d8;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc4498c" class="outline-2">
<h2 id="orgfc4498c"><span class="section-number-2">3</span> Backups</h2>
<div class="outline-text-2" id="text-3">
<p>
Backups are handy for those times where you run out of power
suddenly or you get a kernel panic, but it isn't fun having them
littered around the system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">setq</span>
 backup-by-copying t      <span style="color: #969896; font-style: italic;">; </span><span style="color: #969896; font-style: italic;">don't clobber symlinks</span>
 backup-directory-alist
 '((<span style="color: #70c0b1;">"."</span> . <span style="color: #70c0b1;">"~/.saves"</span>))    <span style="color: #969896; font-style: italic;">; </span><span style="color: #969896; font-style: italic;">don't litter my fs tree</span>
 delete-old-versions t
 kept-new-versions 6
 kept-old-versions 2
 version-control t)       <span style="color: #969896; font-style: italic;">; </span><span style="color: #969896; font-style: italic;">use versioned backups</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org45ac9b7" class="outline-2">
<h2 id="org45ac9b7"><span class="section-number-2">4</span> Enabling the disabled</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf884fbf" class="outline-3">
<h3 id="orgf884fbf"><span class="section-number-3">4.1</span> upcase and downcase region</h3>
<div class="outline-text-3" id="text-4-1">
<p>
I like to be able to do this. I get lots of things that come in
SHOUTING or that need to SHOUT.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee97db7" class="outline-3">
<h3 id="orgee97db7"><span class="section-number-3">4.2</span> Narrowing the region to what I want to look at</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This isn't needed quite so much now that searches, regexp and
otherwise operate, sometimes annoyingly to an old timer like me, on
the region rather than the whole buffer window. I still like to
narrow down to what I'm interested in though and not every handy
tool in emacs is quite so region oriented.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(put 'narrow-to-region 'disabled nil)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga56bfba" class="outline-2">
<h2 id="orga56bfba"><span class="section-number-2">5</span> Custom configuration location</h2>
<div class="outline-text-2" id="text-5">
<p>
custom.el is great for configuring things through that "gui" in
emacs, but it is a real pain when it drops junk in your <a href="../init.el">init.el</a> and
messes up your pretty config and git history and is stuff that you
don't want to leak out on to github. You can change the location of
this file though and I like to do this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">setq</span> custom-file (concat user-emacs-directory <span style="color: #70c0b1;">"local/custom.el"</span>))
(load-if-exists custom-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb675c92" class="outline-2">
<h2 id="orgb675c92"><span class="section-number-2">6</span> Colors</h2>
<div class="outline-text-2" id="text-6">
<p>
It seems trivial, but it is one of the first things I do after I
get the basics up and running. I like to get my colours and other
basic window chrome and geegaws right.
</p>
</div>

<div id="outline-container-org5390d60" class="outline-3">
<h3 id="org5390d60"><span class="section-number-3">6.1</span> <a href="https://github.com/purcell/color-theme-sanityinc-tomorrow">Color Theme Sanityinc Tomorrow</a></h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">use-package</span> <span style="color: #7aa6da;">color-theme-sanityinc-tomorrow</span>
  <span style="color: #c397d8;">:ensure</span> t
  <span style="color: #c397d8;">:config</span> (color-theme-sanityinc-tomorrow-bright))
</pre>
</div>
</div>
</div>

<div id="outline-container-org42d9406" class="outline-3">
<h3 id="org42d9406"><span class="section-number-3">6.2</span> <a href="https://github.com/milkypostman/powerline">Powerline</a></h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">use-package</span> <span style="color: #7aa6da;">powerline</span>
  <span style="color: #c397d8;">:ensure</span> t
  <span style="color: #c397d8;">:config</span> (powerline-default-theme))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org569a5f5" class="outline-2">
<h2 id="org569a5f5"><span class="section-number-2">7</span> Cursors</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orga5d9f88" class="outline-3">
<h3 id="orga5d9f88"><span class="section-number-3">7.1</span> <a href="https://www.emacswiki.org/emacs/NonBlinkingCursor">Show me where the cursor is</a></h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(blink-cursor-mode t)
</pre>
</div>
</div>
</div>


<div id="outline-container-org0582cb9" class="outline-3">
<h3 id="org0582cb9"><span class="section-number-3">7.2</span> <a href="https://www.emacswiki.org/emacs/DeleteSelectionMode">Deleteing a selection</a></h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(delete-selection-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge151c24" class="outline-3">
<h3 id="orge151c24"><span class="section-number-3">7.3</span> <a href="https://www.emacswiki.org/emacs/ShowParenMode">Show parens</a></h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(show-paren-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc32c7c8" class="outline-3">
<h3 id="orgc32c7c8"><span class="section-number-3">7.4</span> indent automatically on a new line</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key global-map (kbd <span style="color: #70c0b1;">"RET"</span>) 'newline-and-indent)
</pre>
</div>
</div>
</div>
</div>
