custom/base-preferences.el
(fset 'yes-or-no-p 'y-or-n-p)

(use-package diminish :ensure t)

(setq
 backup-by-copying t      ; don't clobber symlinks
 backup-directory-alist
 '(("." . "~/.emacs.d/.saves"))    ; don't litter my fs tree
 delete-old-versions t
 kept-new-versions 6
 kept-old-versions 2
 version-control t)       ; use versioned backups

(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)

(put 'narrow-to-region 'disabled nil)

(setq custom-file (concat user-emacs-directory "local/custom.el"))
(load-if-exists custom-file)

(use-package color-theme-sanityinc-tomorrow
  :ensure t
  :config (color-theme-sanityinc-tomorrow-bright))

(use-package powerline
  :ensure t
  :config (powerline-default-theme))

(blink-cursor-mode t)

(delete-selection-mode t)

(show-paren-mode t)

(define-key global-map (kbd "RET") 'newline-and-indent)

;; no toolbar
(tool-bar-mode -1)
