custom/base-preferences.org
* Bars, columns and lines

  I don't want a tool bar or a scroll bar ever and I don't want a
  menu when I'm in a terminal window.  I do like the menu to discover
  new things and keybindings when I'm using emacs as an X
  application.

  #+BEGIN_SRC emacs-lisp
  ;; no toolbar
  (tool-bar-mode -1)

  ;; no menu in a terminal
  (unless window-system
    (menu-bar-mode -1))

  ;; no scroll bar
  ;;(scroll-bar-mode -1)

  ;; no horizontal scroll bar
  (when (boundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))
  #+END_SRC

  I also like to have an idea of where I am in the file so I'd like
  line and column numbers.

  #+BEGIN_SRC emacs-lisp
  (global-linum-mode 1)
  (line-number-mode 1)
  (column-number-mode 1)
  #+END_SRC

* Startup Screen

  I'd also like to skip the startup screen and go straight to the
  *scratch* buffer.

  #+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message ";; scratch buffer created -- happy hacking\n")
  #+END_SRC

* [[https://www.emacswiki.org/emacs/ToggleWindowSplit][Toggle window split]]

  I like to be able to toggle the vertical or horizontal position
  of the window

  #+BEGIN_SRC emacs-lisp
  (defun toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
	(let* ((this-win-buffer (window-buffer))
	       (next-win-buffer (window-buffer (next-window)))
	       (this-win-edges (window-edges (selected-window)))
	       (next-win-edges (window-edges (next-window)))
	       (this-win-2nd (not (and (<= (car this-win-edges)
					   (car next-win-edges))
				       (<= (cadr this-win-edges)
					   (cadr next-win-edges)))))
	       (splitter
		(if (= (car this-win-edges)
		       (car (window-edges (next-window))))
		    'split-window-horizontally
		  'split-window-vertically)))
	  (delete-other-windows)
	  (let ((first-win (selected-window)))
	    (funcall splitter)
	    (if this-win-2nd (other-window 1))
	    (set-window-buffer (selected-window) this-win-buffer)
	    (set-window-buffer (next-window) next-win-buffer)
	    (select-window first-win)
	    (if this-win-2nd (other-window 1))))))

  (global-set-key (kbd "C-x t") 'toggle-window-split)
  #+END_SRC
* displaying the file buffer

  I like the file buffer to display vertically and auto complete for
  me.

  #+BEGIN_SRC emacs-lisp
  (ido-mode t)
  (setq ido-decorations
	(quote
	 ("\n-> "
	  ""
	  "\n   "
	  "\n   ..."
	  "["
	  "]"
	  " [No match]"
	  " [Matched]"
	  " [Not readable]"
	  " [Too big]"
	  " [Confirm]")))
  (defun ido-disable-line-trucation ()
    (set (make-local-variable 'truncate-lines) nil))
  (add-hook 'ido-minibuffer-setup-hook 'ido-disable-line-trucation)
  #+END_SRC
* Whitespace

  indicate empty lines

  #+BEGIN_SRC emacs-lisp
  (setq-default indicate-empty-lines t)
  #+END_SRC

  delete trailing whitespace on save

  #+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
  #+END_SRC
* Auto indent

  #+BEGIN_SRC emacs-lisp
  (defun indent-buffer ()
    (interactive)
    (save-excursion
      (indent-region (point-min) (point-max) nil)))

  (global-set-key (kbd "C-c i") 'indent-buffer)
  #+END_SRC
* [[https://www.emacswiki.org/emacs/FlySpell#toc7][Spell checking]]

** Setup fly spell

   I want to make sure that whenever i am in text mode that my
   spelling is correct. Setting 'flyspell-issue-message-flag' to
   nil will stop fly spell from printing message for every word
   when checking the entire buffer which can cause an enormous
   slowdown.

   #+BEGIN_SRC emacs-lisp
   (use-package flyspell
     :ensure t
     :config
     (add-hook 'text-mode-hook 'flyspell-mode)
     (setq flyspell-issue-message-flg nil))
   #+END_SRC

