custom/base-preferences.html

<div id="outline-container-org22069aa" class="outline-2">
<h2 id="org22069aa"><span class="section-number-2">8</span> Bars, columns and lines</h2>
<div class="outline-text-2" id="text-8">
<p>
I don't want a tool bar or a scroll bar ever and I don't want a
menu when I'm in a terminal window.  I do like the menu to discover
new things and keybindings when I'm using emacs as an X
application.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">no toolbar</span>
(tool-bar-mode -1)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">no menu in a terminal</span>
(<span style="color: #b9ca4a;">unless</span> window-system
  (menu-bar-mode -1))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">no scroll bar</span>
<span style="color: #969896; font-style: italic;">;;</span><span style="color: #969896; font-style: italic;">(scroll-bar-mode -1)</span>

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">no horizontal scroll bar</span>
(<span style="color: #b9ca4a;">when</span> (boundp 'horizontal-scroll-bar-mode)
  (horizontal-scroll-bar-mode -1))
</pre>
</div>

<p>
I also like to have an idea of where I am in the file so I'd like
line and column numbers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-linum-mode 1)
(line-number-mode 1)
(column-number-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org692389a" class="outline-2">
<h2 id="org692389a"><span class="section-number-2">9</span> Startup Screen</h2>
<div class="outline-text-2" id="text-9">
<p>
I'd also like to skip the startup screen and go straight to the
<b>scratch</b> buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">setq</span> inhibit-startup-screen t)
(<span style="color: #b9ca4a;">setq</span> initial-scratch-message <span style="color: #70c0b1;">";; scratch buffer created -- happy hacking\n"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4ab8fc" class="outline-2">
<h2 id="orgf4ab8fc"><span class="section-number-2">10</span> <a href="https://www.emacswiki.org/emacs/ToggleWindowSplit">Toggle window split</a></h2>
<div class="outline-text-2" id="text-10">
<p>
I like to be able to toggle the vertical or horizontal position of the window
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">toggle-window-split</span> ()
  (<span style="color: #b9ca4a;">interactive</span>)
  (<span style="color: #b9ca4a;">if</span> (= (count-windows) 2)
      (<span style="color: #b9ca4a;">let*</span> ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (<span style="color: #b9ca4a;">and</span> (&lt;= (car this-win-edges)
                                         (car next-win-edges))
                                     (&lt;= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (<span style="color: #b9ca4a;">if</span> (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (<span style="color: #b9ca4a;">let</span> ((first-win (selected-window)))
          (funcall splitter)
          (<span style="color: #b9ca4a;">if</span> this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (<span style="color: #b9ca4a;">if</span> this-win-2nd (other-window 1))))))

(global-set-key (kbd <span style="color: #70c0b1;">"C-x t"</span>) 'toggle-window-split)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5e2e032" class="outline-2">
<h2 id="org5e2e032"><span class="section-number-2">11</span> displaying the file buffer</h2>
<div class="outline-text-2" id="text-11">
<p>
I like the file buffer to display vertically and auto complete for me.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(ido-mode t)
(<span style="color: #b9ca4a;">setq</span> ido-decorations
      (<span style="color: #b9ca4a;">quote</span>
       (<span style="color: #70c0b1;">"\n-&gt; "</span> <span style="color: #70c0b1;">""</span> <span style="color: #70c0b1;">"\n   "</span> <span style="color: #70c0b1;">"\n   ..."</span> <span style="color: #70c0b1;">"["</span> <span style="color: #70c0b1;">"]"</span> <span style="color: #70c0b1;">" [No match]"</span> <span style="color: #70c0b1;">" [Matched]"</span>
        <span style="color: #70c0b1;">" [Not readable]"</span> <span style="color: #70c0b1;">" [Too big]"</span> <span style="color: #70c0b1;">" [Confirm]"</span>)))
(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">ido-disable-line-trucation</span> ()
  (set (make-local-variable 'truncate-lines) nil))
(add-hook 'ido-minibuffer-setup-hook 'ido-disable-line-trucation)
</pre>
</div>
</div>
</div>
<div id="outline-container-org06c8d71" class="outline-2">
<h2 id="org06c8d71"><span class="section-number-2">12</span> Whitespace</h2>
<div class="outline-text-2" id="text-12">
<p>
indicate empty lines
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">setq-default</span> indicate-empty-lines t)
</pre>
</div>

<p>
delete trailing whitespace on save
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'before-save-hook 'delete-trailing-whitespace)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge6f476b" class="outline-2">
<h2 id="orge6f476b"><span class="section-number-2">13</span> Auto indent</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">indent-buffer</span> ()
  (<span style="color: #b9ca4a;">interactive</span>)
  (<span style="color: #b9ca4a;">save-excursion</span>
    (indent-region (point-min) (point-max) nil)))

(global-set-key (kbd <span style="color: #70c0b1;">"C-c i"</span>) 'indent-buffer)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc62962c" class="outline-2">
<h2 id="orgc62962c"><span class="section-number-2">14</span> Auto Complete</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">unless</span> (package-installed-p 'auto-complete)
  (package-install 'auto-complete))
(<span style="color: #b9ca4a;">require</span> '<span style="color: #7aa6da;">auto-complete</span>)
(add-to-list 'ac-dictionary-directories <span style="color: #70c0b1;">"~/.emacs.d/ac-dict"</span>)

(<span style="color: #b9ca4a;">setq</span> ac-ignore-case nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e80be3" class="outline-2">
<h2 id="org1e80be3"><span class="section-number-2">15</span> <a href="https://www.emacswiki.org/emacs/FlySpell#toc7">Spell checking</a></h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgbedda17" class="outline-3">
<h3 id="orgbedda17"><span class="section-number-3">15.1</span> Setup fly spell</h3>
<div class="outline-text-3" id="text-15-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">require</span> '<span style="color: #7aa6da;">flyspell</span>)
(add-hook 'text-mode-hook 'flyspell-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org55f022a" class="outline-3">
<h3 id="org55f022a"><span class="section-number-3">15.2</span> Performance</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Setting 'flyspell-issue-message-flag' to nil will stop fly spell from
printing message for every word when checking the entire buffer which can cause an enormous slowdown.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">setq</span> flyspell-issue-message-flg nil)
</pre>
</div>
</div>
</div>
