custom/base-preferences.html

<div id="outline-container-org0e7269e" class="outline-3">
<h3 id="org0e7269e"><span class="section-number-3">15.3</span> I like having a pop-up with spelling suggestions.</h3>
<div class="outline-text-3" id="text-15-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">flyspell-emacs-popup-textual</span> (event poss word)
  <span style="color: #c397d8;">"A textual flyspell popup menu."</span>
  (<span style="color: #b9ca4a;">require</span> '<span style="color: #7aa6da;">popup</span>)
  (<span style="color: #b9ca4a;">let*</span> ((corrects (<span style="color: #b9ca4a;">if</span> flyspell-sort-corrections
                       (sort (car (cdr (cdr poss))) 'string&lt;)
                     (car (cdr (cdr poss)))))
         (cor-menu (<span style="color: #b9ca4a;">if</span> (consp corrects)
                       (mapcar (<span style="color: #b9ca4a;">lambda</span> (correct)
                                 (list correct correct))
                               corrects)
                     '()))
         (affix (car (cdr (cdr (cdr poss)))))
         show-affix-info
         (base-menu  (<span style="color: #b9ca4a;">let</span> ((save (<span style="color: #b9ca4a;">if</span> (<span style="color: #b9ca4a;">and</span> (consp affix) show-affix-info)
                                     (list
                                      (list (concat <span style="color: #70c0b1;">"Save affix: "</span> (car affix))
                                            'save)
                                      '(<span style="color: #70c0b1;">"Accept (session)"</span> session)
                                      '(<span style="color: #70c0b1;">"Accept (buffer)"</span> buffer))
                                   '((<span style="color: #70c0b1;">"Save word"</span> save)
                                     (<span style="color: #70c0b1;">"Accept (session)"</span> session)
                                     (<span style="color: #70c0b1;">"Accept (buffer)"</span> buffer)))))
                       (<span style="color: #b9ca4a;">if</span> (consp cor-menu)
                           (append cor-menu (cons <span style="color: #70c0b1;">""</span> save))
                         save)))
         (menu (mapcar
                (<span style="color: #b9ca4a;">lambda</span> (arg) (<span style="color: #b9ca4a;">if</span> (consp arg) (car arg) arg))
                base-menu)))
    (cadr (assoc (popup-menu* menu <span style="color: #c397d8;">:scroll-bar</span> t) base-menu))))

(eval-after-load <span style="color: #70c0b1;">"flyspell"</span>
  '(<span style="color: #b9ca4a;">progn</span>
     (fset 'flyspell-emacs-popup 'flyspell-emacs-popup-textual)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b376f9" class="outline-3">
<h3 id="org0b376f9"><span class="section-number-3">15.4</span> I also want it to work no matter what mode emacs is in (i.e. GUI or terminal)</h3>
<div class="outline-text-3" id="text-15-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">flyspell-emacs-popup-choose</span> (org-fun event poss word)
  (<span style="color: #b9ca4a;">if</span> (window-system)
      (funcall org-fun event poss word)
    (flyspell-emacs-popup-textual event poss word)))

(eval-after-load <span style="color: #70c0b1;">"flyspell"</span>
  '(<span style="color: #b9ca4a;">progn</span>
     (advice-add 'flyspell-emacs-popup <span style="color: #c397d8;">:around</span> #'flyspell-emacs-popup-choose)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga12a570" class="outline-3">
<h3 id="orga12a570"><span class="section-number-3">15.5</span> Finally I want simple ways to invoke it.</h3>
<div class="outline-text-3" id="text-15-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #70c0b1;">"C-c s"</span>) 'flyspell-correct-word-before-point)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org88ea5c1" class="outline-2">
<h2 id="org88ea5c1"><span class="section-number-2">16</span> <a href="https://github.com/jaypei/emacs-neotree">File tree</a></h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-load-if-exists <span style="color: #70c0b1;">"custom/tree.org"</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ryan Durling</p>
<p class="date">Created: 2020-02-24 Mon 13:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
