custom/base-preferences.el
  "A textual flyspell popup menu."
  (require 'popup)
  (let* ((corrects (if flyspell-sort-corrections
		       (sort (car (cdr (cdr poss))) 'string<)
		     (car (cdr (cdr poss)))))
	 (cor-menu (if (consp corrects)
		       (mapcar (lambda (correct)
				 (list correct correct))
			       corrects)
		     '()))
	 (affix (car (cdr (cdr (cdr poss)))))
	 show-affix-info
	 (base-menu
	  (let ((save
		 (if (and (consp affix) show-affix-info)
		     (list
		      (list (concat "Save affix: " (car affix))
			    'save)
		      '("Accept (session)" session)
		      '("Accept (buffer)" buffer))
		   '(("Save word" save)
		     ("Accept (session)" session)
		     ("Accept (buffer)" buffer)))))
	    (if (consp cor-menu)
		(append cor-menu (cons "" save))
	      save)))
	 (menu (mapcar
		(lambda (arg) (if (consp arg) (car arg) arg))
		base-menu)))
    (cadr (assoc (popup-menu* menu :scroll-bar t) base-menu))))

(eval-after-load "flyspell"
  '(progn
     (fset 'flyspell-emacs-popup 'flyspell-emacs-popup-textual)))

(defun flyspell-emacs-popup-choose (org-fun event poss word)
  (if (window-system)
      (funcall org-fun event poss word)
    (flyspell-emacs-popup-textual event poss word)))

(eval-after-load "flyspell"
  '(progn
     (advice-add 'flyspell-emacs-popup
		 :around #'flyspell-emacs-popup-choose)))

(global-set-key (kbd "C-c s") 'flyspell-correct-word-before-point)

(org-babel-load-if-exists "custom/tree.org")

(use-package popup :ensure t)

(defun duplicate-current-line-or-region (arg)
  "Duplicates the current line or region ARG times.
  If there's no region, the current line will be duplicated. However, if
  there's a region, all lines that region covers will be duplicated."
  (interactive "p")
  (let (beg end (origin (point)))
    (if (and mark-active (> (point) (mark)))
	(exchange-point-and-mark))
    (setq beg (line-beginning-position))
    (if mark-active
	(exchange-point-and-mark))
    (setq end (line-end-position))
    (let ((region (buffer-substring-no-properties beg end)))
      (dotimes (i arg)
	(goto-char end)
	(newline)
	(insert region)
	(setq end (point)))
      (goto-char (+ origin (* (length region) arg) arg)))))

(global-set-key (kbd "C-c d") 'duplicate-current-line-or-region)
